import sys
import path

course_list = [
    ("秋名湖／左周り", 0),
    ("秋名湖／右周り", 2),
    ("箱根／下り", 52),
    ("箱根／上り", 54),
    ("碓氷／左周り", 36),
    ("碓氷／右周り", 38),
    ("妙義／下り", 4),
    ("妙義／上り", 6),
    ("赤城／下り", 8),
    ("赤城／上り", 10),
    ("秋名／下り", 12),
    ("秋名／上り", 14),
    ("いろは坂／下り", 16),
    ("いろは坂／逆走", 18),
    ("筑波／往路", 20),
    ("筑波／復路", 22),
    ("もみじライン／下り", 56),
    ("もみじライン／上り", 58),
    ("八方ヶ原／往路", 24),
    ("八方ヶ原／復路", 26),
    ("長尾／下り", 28),
    ("長尾／上り", 30),
    ("定峰／下り", 40),
    ("定峰／上り", 42),
    ("土坂／往路", 44),
    ("土坂／復路", 46),
    ("七曲り／下り", 60),
    ("七曲り／上り", 62),
    ("椿ライン／下り", 32),
    ("椿ライン／上り", 34),
    ("秋名（雪）／下り", 48),
    ("秋名（雪）／上り", 50),
    ("群サイ／往路", 64),
    ("群サイ／復路", 66),
    ("小田原／順走", 68),
    ("小田原／逆走", 70),
    ("筑波（雪）／往路", 72),
    ("筑波（雪）／復路", 74),
    ("土坂（雪）／往路", 80),
    ("土坂（雪）／復路", 82),
    ("ヤビツ／下り", 76),
    ("ヤビツ／上り", 78),
    ("真鶴／順走", 84),
    ("真鶴／逆走", 86)
    ]

course_list_len = len(course_list)

def get_course_and_url(index: int = -1) -> tuple[str, str]:
    # Check index
    if (index < 0) or (index > course_list_len):
        sys.exit("Wrong course index! The program exits.")
    
    return course_list[index][0], path.url_begin + str(course_list[index][1]) + path.url_end
    
if __name__ == "__main__":
    print("\nThere are " + str(course_list_len) + " courses.\n")